Revit 2024 API
TaskDialog.Id Property
 The Id of the task dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public string Id { get; set; }
Visual Basic
Public Property Id As String
	Get
	Set
Visual C++
public:
property String^ Id {
	String^ get ();
	void set (String^ value);
}
Remarks
 Id is used as follows:
 TaskDialogShowingEventArgs.DialogId for DialogBoxShowing events
 As part of the Contextual Help Topic when invoking Revit contextual help
See Also
TaskDialog Class
Autodesk.Revit.UI Namespace